historic/archive/buffered/m2.x4large_eph/randread-06-64.fio.out
randread-64k: (g=0): rw=randread, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 1 process

randread-64k: (groupid=0, jobs=1): err= 0: pid=1979: Sat Mar 15 04:27:51 2014
  read : io=622272KB, bw=10371KB/s, iops=162, runt= 60002msec
    slat (usec): min=486, max=200627, avg=6163.53, stdev=4235.24
    clat (usec): min=6, max=299180, avg=55475.44, stdev=15323.41
     lat (msec): min=4, max=305, avg=61.64, stdev=16.35
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[   41], 10.00th=[   44], 20.00th=[   47],
     | 30.00th=[   50], 40.00th=[   52], 50.00th=[   55], 60.00th=[   57],
     | 70.00th=[   59], 80.00th=[   62], 90.00th=[   66], 95.00th=[   71],
     | 99.00th=[  108], 99.50th=[  135], 99.90th=[  262], 99.95th=[  269],
     | 99.99th=[  302]
    bw (KB  /s): min= 4326, max=11865, per=100.00%, avg=10372.02, stdev=1138.24
    lat (usec) : 10=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=31.81%, 100=66.83%, 250=1.17%
    lat (msec) : 500=0.15%
  cpu          : usr=0.15%, sys=0.94%, ctx=9883, majf=0, minf=186
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=9723/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=622272KB, aggrb=10370KB/s, minb=10370KB/s, maxb=10370KB/s, mint=60002msec, maxt=60002msec

Disk stats (read/write):
  xvdf: ios=19400/0, merge=0/0, ticks=119176/0, in_queue=119180, util=99.41%